FROM python:3.11.1

# Установка рабочей директории
WORKDIR /app

# Копирование виртуального окружения
COPY myenv /myenv

# Установка переменной окружения для использования виртуального окружения
ENV PATH="/myenv/scripts:$PATH"

# Активация виртуального окружения и проверка
RUN echo "Активация виртуального окружения..." && \
    . /myenv/scripts/activate && \
    echo "Виртуальное окружение активировано." && \
    echo "Проверка Python и pip:" && \
    python --version && \
    pip --version

# Копирование остальных файлов
COPY . .

# Логирование: завершение сборки
RUN echo "Сборка завершена."

# Команда для запуска приложения
CMD ["python", "main.py"]
